Soccer-Scouting-Backend/app/controllers/bookmarked_players_controller.rb

    def index
      bookmarked_players = BookmarkedPlayer.order("created_at DESC")
---
SELECT "bookmarked_players".* FROM "bookmarked_players" ORDER BY created_at DESC