Soccer-Scouting-Backend/app/controllers/players_controller.rb

    def index
      players = Player.all
---
SELECT "players".* FROM "players" ORDER BY created_at DESC