Soccer-Scouting-Backend/app/controllers/scouts_controller.rb

    def index
      scouts = Scout.order("created_at DESC")
---
SELECT "scouts".* FROM "scouts" ORDER BY created_at DESC