Soccer-Scouting-Backend/app/controllers/teams_controller.rb

    def index
      teams = Team.all
---
SELECT "teams".* FROM "teams" ORDER BY created_at DESC