Soccer-Scouting-Backend/app/controllers/api/v1/auth_controller.rb

SELECT "scouts".* FROM "scouts" WHERE "scouts"."username" = ? LIMIT ?  [["username", "ctomashot"], ["LIMIT", 1]]
---
    def create

        scout = Scout.find_by(username: params[:username])

SELECT "scouts".* FROM "scouts" WHERE "scouts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        hmac_secret = 'my_secret'

        token = request.headers[:Authorization].split(' ')[1]
        decoded_token = JWT.decode(token, hmac_secret, true, { algorithm: 'HS256' })
        scout_id = decoded_token[0]['scout_id']

        scout = Scout.find(scout_id)